# IFC_WriteProjectData

## Description
Writes specified field data to the Export IFC Project dialog.

```pascal
FUNCTION IFC_WriteProjectData(
				iPane     : INTEGER;
				iParam    : INTEGER;
				iBuilding : INTEGER;
				data      : STRING) : BOOLEAN;
```

```python

def vs.IFC_WriteProjectData(iPane, iParam, iBuilding, data):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|iPane|INTEGER||
|iParam|INTEGER||
|iBuilding|INTEGER||
|data|STRING||

## Version
Availability: from Vectorworks 2024
## Category
* IFC